# =============================================
# Core tools
# =============================================
brew "chezmoi"
brew "git"
brew "gh"
brew "neovim"
brew "tmux"
brew "starship"
brew "sheldon"
brew "fzf"
brew "ripgrep"
brew "eza"
brew "zoxide"
brew "lazygit"
brew "ghq"
brew "jq"
brew "yq"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "chafa"
brew "mise"

# =============================================
# Development
# =============================================
brew "uv"
brew "rustup"
brew "protobuf"
brew "grpcurl"
brew "mkcert"
brew "yamllint"

# =============================================
# Kubernetes / Infrastructure
# =============================================
tap "derailed/k9s"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "siderolabs/tap"

brew "tenv"
brew "derailed/k9s/k9s"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/vault"
brew "siderolabs/tap/talosctl"
brew "argocd"
brew "kind"
brew "kustomize"
brew "cosign"
brew "cloudflared"
brew "dnsmasq"
brew "ansible"
brew "ansible-lint"

# =============================================
# AI
# =============================================
brew "codex"

# =============================================
# GUI Apps
# =============================================
cask "font-hackgen-nerd"
cask "ghostty"
