# =============================================
# Core tools
# =============================================
brew "chezmoi"
brew "git"
brew "gh"
brew "neovim"
brew "tmux" # fallback (メインは herdr に移行済み)
brew "herdr"
brew "starship"
brew "sheldon"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "lazygit"
brew "hunk" # レビュー特化 diff ビューア (herdr Prefix+Shift+H で起動)
brew "ghq"
brew "jq"
brew "yq"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "mise"

# =============================================
# Development
# =============================================
# Runtimes are managed by mise via ~/.config/mise/config.toml
brew "protobuf"
brew "grpcurl"
brew "mkcert"
brew "nixfmt"

# =============================================
# Kubernetes / Infrastructure
# =============================================
# core の flux は InfluxData 製の別物なので FluxCD は tap が必須。
# vault もライセンス変更で core から削除済みのため tap が必須。
tap "fluxcd/tap"
tap "hashicorp/tap"

brew "tenv"
brew "k9s"
brew "fluxcd/tap/flux"
brew "hashicorp/tap/vault"
brew "talosctl"
brew "argocd"
brew "kind"
brew "kustomize"
brew "cosign"
brew "cloudflared"
brew "dnsmasq"

# =============================================
# AI
# =============================================
cask "codex"

# =============================================
# GUI Apps
# =============================================
cask "font-hackgen-nerd"
cask "font-maple-mono-nf"
cask "ghostty"
